---
kind: property
id: P:Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.ReportStyle
source: html/93f766a8-2575-fdf4-6f05-278c4cf921a6.htm
---
# Autodesk.Revit.DB.Analysis.ViewSystemsAnalysisReport.ReportStyle Property

The report style that specifies the display content.

## Syntax (C#)
```csharp
public SystemsAnalysisReportStyle ReportStyle { get; set; }
```

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentOutOfRangeException** - When setting this property: A value passed for an enumeration argument is not a member of that enumeration